app/Controllers/Dokumen.php

    public function index()
    {
		$dokumen = new DokumenModel();
		$data['dokumen'] = $dokumen->findAll();
---
SELECT *
FROM `tb_dokumen`