app/Controllers/Formupload.php

SELECT *
FROM `tb_dokumen`
---
    public function index()
    {
        $dokumen = new DokumenModel();
		$data['dokumen'] = $dokumen->findAll();